package by.epam.modul1.linear_program;
/*
3. Вычислить значение выражения по формуле(все переменные принимают действительные значения):
 */

public class Task3 {
    public static void main(String[] args) {
        double x=6,y=4;
        System.out.println(((Math.sin(x)+Math.cos(y))/(Math.cos(x)-Math.sin(y)))*Math.tan(x*y));
    }
}
